In [2]:
import sqlite3
con=sqlite3.connect("demo.db")
cur=con.cursor()
cur.execute("create table employee(Id,Name,Salary,Job)")
cur.execute(""" insert into employee values(1001,'ANN',75000,'Manager'),(1002,'BEN',16000,'Clerk'),(1003,'Charles',12650,'Saleman'),(1004,'Sam',30000,'Analyst'),(1005,'Sara',45000,'Analyst')""")
con.commit()
res=cur.execute("select Name from employee")
res.fetchone()
print(res.fetchone())
res=cur.execute("select * from employee")
res.fetchall()

('BEN',)

[(1001, 'ANN', 75000, 'Manager'),
 (1002, 'BEN', 16000, 'Clerk'),
 (1003, 'Charles', 12650, 'Saleman'),
 (1004, 'Sam', 30000, 'Analyst'),
 (1005, 'Sara', 45000, 'Analyst')]

In [1]:
import sqlite3
con=sqlite3.connect("demo.db")
cur=con.cursor()
res=cur.execute("DROP TABLE employee")
res.fetchall()

[]

In [5]:
res=cur.execute("update employee set Salary=80000 where Job='Manager'")
res=cur.execute("select * from employee")
res.fetchall()

[(1001, 'ANN', 80000, 'Manager'),
 (1002, 'BEN', 16000, 'Clerk'),
 (1003, 'Charles', 12650, 'Saleman'),
 (1004, 'Sam', 30000, 'Analyst'),
 (1005, 'Sara', 45000, 'Analyst')]

In [11]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('abc.db')
c = conn.cursor()

c.execute('create table stu ( ID, Name, Course)')
conn.commit()
c.executemany('insert into stu VALUES (?, ?, ?)',
    [(1, 'Ann','CS'),
     (2, 'Ben','Physics'),
     (3, 'Charles','Chemistry'),
     (4, 'Jhon','MBA'),
     (5, 'Merry','Yoga')])
conn.commit()
print (list(c.execute('SELECT * FROM stu')))
print (pd.read_sql_query('SELECT * FROM stu', conn))

[(1, 'Ann', 'CS'), (2, 'Ben', 'Physics'), (3, 'charles', 'Chemistry'), (4, 'Jhon', 'MBA'), (5, 'Merry', 'Yoga')]
   ID     Name     Course
0   1      Ann         CS
1   2      Ben    Physics
2   3  charles  Chemistry
3   4     Jhon        MBA
4   5    Merry       Yoga

In [14]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print("Table created successfully")

conn.close()

Opened database successfully
Table created successfully

In [15]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully")

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3])

print("Table created successfully")
conn.close()

Opened database successfully
Table created successfully

In [16]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('test.db')
print ("Opened database successfully")
conn.execute("DELETE from COMPANY where ID = 3;")
conn.commit()
print ("Total number of rows deleted :", conn.total_changes)
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
    print ("ID = ", row[0])
    print ("NAME = ", row[1])
    print ("ADDRESS = ", row[2])
    print ("SALARY = ", row[3])
print (pd.read_sql_query("SELECT * FROM COMPANY", conn))
print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows deleted : 0
Empty DataFrame
Columns: [ID, NAME, AGE, ADDRESS, SALARY]
Index: []
Operation done successfully